{
  "backend/main.mo": "Motoko canister managing access-controlled user profiles, quick-buy lists, and schedules with basic CRUD operations and permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related source files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing MapView, i18n utilities, and global theme styling.",
  "frontend/index.css": "Tailwind-based global styles defining color variables and themes for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx.",
  "frontend/README.md": "Frontend overview documenting features, setup requirements, and capabilities of the Smart Shopping Planner.",
  "frontend/src/App.tsx": "Main React component wiring authentication, user profile setup, planner form, shop discovery, recommendations, and schedule export UI.",
  "frontend/src/components/AppHeader.tsx": "Header component showing app branding, language toggle, and login/logout controls using Internet Identity.",
  "frontend/src/components/CategoryMappingEditor.tsx": "UI component allowing users to assign categories to items for improved shop relevance ranking.",
  "frontend/src/components/CostSummary.tsx": "Displays estimated total cost, budget status, and top cost items with editable price overrides.",
  "frontend/src/components/DemoModeToggle.tsx": "Toggles demo mode and loads predefined sample location and items when enabled.",
  "frontend/src/components/DiscoveryPanel.tsx": "Manages shop discovery using selected provider, category filtering, and toggles between list or map views.",
  "frontend/src/components/EmptyState.tsx": "Shows a fallback message when no shops are found and provides a retry button.",
  "frontend/src/components/ExportPanel.tsx": "Exports schedule data to ICS or PDF, saves schedules, and includes cost summary and notes editing.",
  "frontend/src/components/ItemsEditor.tsx": "Allows adding, removing, and voice‑dictating shopping list items.",
  "frontend/src/components/LanguageToggle.tsx": "Switches the app language between English and Hindi.",
  "frontend/src/components/MapView.tsx": "Renders an embedded map with shop markers and selectable shop cards.",
  "frontend/src/components/PastSchedulesDrawer.tsx": "Drawer component that lists past schedules, allows cloning and deleting schedules, and displays key details like location, date, items, and budget.",
  "frontend/src/components/PlannerForm.tsx": "Form for creating a shopping plan, handling location, datetime, items, geolocation, validation, and access to past schedules.",
  "frontend/src/components/PriceComparison.tsx": "Displays price comparisons across shops, highlights the cheapest option, and computes totals using compareShopPrices.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for initial user profile setup that saves a user's name through a backend mutation with validation and feedback.",
  "frontend/src/components/QuickBuyList.tsx": "Shows a quick-pick list of common or user-defined items, allowing one-click addition to the planner.",
  "frontend/src/components/RecommendationsPanel.tsx": "Displays top-ranked shop recommendations with visit-time suggestions and lets users select a shop.",
  "frontend/src/components/ShopsList.tsx": "Renders a list of shops with details like rating, distance, and status, and supports selecting a shop.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useGeolocation.ts": "Provides a helper for requesting the user's geolocation with loading state and formatted results.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, schedules, and quick-buy lists with caching and mutations.",
  "frontend/src/hooks/useSpeechToText.ts": "Custom hook that wraps Web Speech API to provide speech‑to‑text with start/stop controls and transcript state.",
  "frontend/src/index.css": "Tailwind setup defining base styles and an India-inspired light/dark color palette using CSS variables.",
  "frontend/src/lib/categories.ts": "Utility for inferring item categories based on defaults or user mappings.",
  "frontend/src/lib/costing.ts": "Functions for estimating item costs, finding highest‑cost items, and comparing shop totals using simple heuristics.",
  "frontend/src/lib/demoData.ts": "Provides demo location, items, and example shop data with metadata for testing or mock UI.",
  "frontend/src/lib/exports/ics.ts": "Generates and downloads an ICS calendar file for a shopping schedule event.",
  "frontend/src/lib/exports/pdf.ts": "Creates an HTML-based printable PDF window for a shopping schedule with cost and shop details.",
  "frontend/src/lib/geo.ts": "Distance and ETA utilities using haversine formula and assumed city travel speed.",
  "frontend/src/lib/i18n.tsx": "Defines bilingual English/Hindi translation strings and provides React context helpers for language selection.",
  "frontend/src/lib/providers/placesProviders.ts": "Implements shop discovery via demo data, OSM, or Google, returning normalized shop results with distance, ETA, and status.",
  "frontend/src/lib/scheduling.ts": "Provides utilities to rank shops by openness, rating, and distance, and to suggest visit times with contextual notes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, typography, animations, and container settings with plugins.",
  "project_state.json": "Describes the project’s high-level state, features, architecture, images, and requirements metadata."
}