{
  "kind": "build_request",
  "title": "Grocery Shopping Schedule Planner with Nearby Store Discovery, Map View, Exports, and Bilingual UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a mobile-responsive app flow that collects: location (manual city/pincode + optional browser geolocation), preferred shopping date/time, budget, and a list of items via a simple form; also support optional voice-to-text entry for items using the browser Web Speech API when available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Collect the user's current location (via geolocation or manual entry of city/pincode, e.g., Indore, Madhya Pradesh), preferred shopping date/time, budget, and a list of items (e.g., milk, bread, snacks) via a simple form or voice input."
        ]
      },
      "acceptanceCriteria": [
        "User can enter city/pincode and/or click a button to use browser geolocation (with permission) to set location.",
        "User can add/edit/remove items in a list; voice input can append recognized text into the items list when supported; graceful fallback when not supported.",
        "Form validation prevents empty required fields (location, date/time, at least 1 item) and shows clear inline errors.",
        "Layout works well on mobile widths (no horizontal scrolling; key actions accessible)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement nearby shop discovery using an external places data source with a configurable provider option (e.g., OpenStreetMap Nominatim/Overpass by default, and optionally Google Places if the user provides an API key in-app). Search for grocery stores/supermarkets/kirana-type places near the user location and return for each result: shop name, exact address, distance in km, current opening status (open now / closed / unknown), phone number if available, and estimated travel time.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Integrate a location API like Google Places API, OpenStreetMap, or Foursquare to search for the nearest grocery stores, supermarkets, or local kirana shops stocking similar items.",
          "For each shop, fetch and display: shop name, exact address, distance (in km), current opening status, phone number, and estimated travel time."
        ]
      },
      "acceptanceCriteria": [
        "User can run a “Find nearby shops” action after providing location + items.",
        "App displays a results list with the required fields (name, address, distance, opening status, phone if present, ETA).",
        "Filtering is applied when the provider returns the data: prioritize open-now first; enforce rating >= 4 when ratings are available; otherwise label rating as unavailable and do not break the flow.",
        "If the external API fails or is blocked, the app falls back to a built-in demo dataset for Indore, India (including examples like D-Mart and local stores) so the feature remains testable."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add item-to-category matching so the shop discovery can prioritize relevant shop types/categories (e.g., groceries vs goodies/snacks) based on the user’s item list. Provide a simple, editable mapping in the UI (defaults included).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Prioritize 'available' options by filtering for shops that are open now (use real-time hours data), have high ratings (4+ stars), and match item categories (groceries/goodies)."
        ]
      },
      "acceptanceCriteria": [
        "App computes categories from the item list using a default mapping and shows the inferred categories to the user.",
        "User can adjust categories (e.g., mark an item as “goodies/snacks”) and rerun discovery.",
        "Discovery query/filters use the category info to bias or filter results where supported by the provider; otherwise show a label indicating category filtering is limited by provider data."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Generate a smart shopping schedule recommending the top 3 nearest suitable shops, including an optimal visit time slot for each recommendation based on the user’s preferred date/time and each shop’s opening hours (when available).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Suggest the top 3 nearest available shops with a smart schedule: optimal shopping time slot (e.g., 'Visit Shop X at 5 PM today – 2.5 km away, open till 10 PM')."
        ]
      },
      "acceptanceCriteria": [
        "App selects and displays “Top 3” recommendations using a clear ranking (open-now first, then distance; incorporate rating when available).",
        "Each recommendation includes a suggested visit time (based on preferred date/time + shop open hours when available; otherwise mark hours as unknown and keep the preferred time).",
        "User can choose one of the recommended schedules to save/export."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Provide shareable schedule exports: (1) a downloadable calendar event (.ics) and (2) a downloadable PDF. Exports must include: item list, selected shop details, estimated total cost, and reminders/notes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Generate a shareable schedule (calendar event or PDF) including item list, shop details, total estimated cost (use average prices from API or hardcoded data), and reminders."
        ]
      },
      "acceptanceCriteria": [
        "User can download an .ics file that imports into calendar apps with the correct date/time and location text.",
        "User can download a PDF summarizing the schedule and items (readable on mobile).",
        "Exports include estimated total cost and a reminders/notes section (editable by the user before export)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement cost estimation and affordability helpers: maintain a built-in average price table for common items (India-focused defaults) and compute an estimated total; show whether the plan is within the user’s budget and highlight the highest-cost items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "total estimated cost (use average prices from API or hardcoded data)",
          "focus on affordability and convenience"
        ]
      },
      "acceptanceCriteria": [
        "Estimated total cost is shown before saving/exporting and updates when items change.",
        "UI clearly indicates within-budget vs over-budget and shows the delta.",
        "User can edit per-item assumed prices for their schedule (overrides default)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add shopping helper features: (a) a “Quick buy list” of common goodies/snacks (user can add to items with one tap), (b) price comparison across the discovered shops when shop-specific price data is unavailable (use a simple heuristic: same base item prices with configurable per-shop multiplier), and (c) reorder from past schedules.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add features like 'quick buy list' for common goodies, price comparison across shops, and reordering from past schedules."
        ]
      },
      "acceptanceCriteria": [
        "Quick buy list is visible and adds selected items into the current list.",
        "Price comparison view shows estimated totals per shop for the same basket and highlights the cheapest option (with a disclaimer that it’s estimated).",
        "User can select a past schedule and clone it into a new schedule (items + prices + notes), then re-run shop discovery."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Persist user schedules in the Internet Computer backend (Motoko) so schedules can be saved, listed, viewed, and deleted. Store at minimum: createdAt, location input, preferred date/time, budget, items (with optional price overrides), selected shop snapshot, computed estimates, and export metadata.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "SQLite for storing user schedules.",
          "reordering from past schedules"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes methods to create/read/list/delete schedules.",
        "Schedules persist across page reloads and canister upgrades (use stable storage appropriately).",
        "Frontend shows a “My schedules” list with basic details and supports viewing and deleting an entry."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add a bilingual UI toggle (English/Hindi) for the main user-facing UI strings, defaulting to English. The toggle must not require a page reload and should persist the user preference locally.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "with Hindi/English toggle"
        ]
      },
      "acceptanceCriteria": [
        "User can toggle English/Hindi and see UI labels update immediately.",
        "Language preference persists across reloads in the browser.",
        "If any string is missing a translation, it falls back to English."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a map visualization that plots the user location and discovered shops, and allows selecting a shop from the map to view details. Use a frontend map library compatible with React (no server-side rendering).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Folium or Google Maps for visualizing shop locations on a map"
        ]
      },
      "acceptanceCriteria": [
        "Map renders markers for discovered shops and an indicator for the user location (when available).",
        "Clicking a marker opens a details panel/card with the same fields shown in the list.",
        "Map gracefully handles the “no results” case (shows message and no markers)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Implement robust error handling and empty states: if no nearby shops are found or API calls fail, show a clear message and suggest alternatives (e.g., consider delivery apps) while still allowing schedule creation using the demo dataset.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Include error handling for no nearby shops (suggest alternatives like delivery apps)."
        ]
      },
      "acceptanceCriteria": [
        "When there are no results, UI presents an actionable empty state (edit location, broaden search, use demo mode) and suggests delivery alternatives in generic terms.",
        "Errors are displayed in a user-friendly manner; technical details are logged to console only.",
        "User can still proceed to create/export a schedule using manually selected/demo shops."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add an Indore, India demo mode with sample shops and sample items so the app can be demonstrated without any external API keys. Include at least one “D-Mart” example and a couple of local stores with plausible addresses and opening hours.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a demo with sample data for Indore, India (e.g., shops like D-Mart or local stores)."
        ]
      },
      "acceptanceCriteria": [
        "A visible toggle/button enables demo mode and pre-fills location as Indore (or allows selecting it).",
        "Demo mode produces at least 3 shop results with distances and opening status derived from the demo data.",
        "App clearly labels demo data as sample data."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Provide a coherent visual theme and apply it consistently across the app (colors, typography, spacing, and component styling). Choose a warm, India-inspired palette (avoid blue/purple) and a clean, utility-first layout optimized for quick one-handed mobile use.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make the app user-friendly for busy folks in India, with Hindi/English toggle, and focus on affordability and convenience"
        ]
      },
      "acceptanceCriteria": [
        "App uses a consistent theme (e.g., saffron/amber + charcoal + neutral backgrounds) across pages and components.",
        "Primary actions are visually prominent and consistent.",
        "Mobile layout supports quick scanning: clear hierarchy, readable text, and accessible tap targets."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add setup and deployment documentation for the Internet Computer project (local dev and mainnet), including any required external API keys (optional), where to configure them, and how to run the demo mode without keys.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Provide complete, runnable code with setup instructions (e.g., pip installs, API keys needed). Deploy it to Streamlit Cloud or Heroku if possible."
        ]
      },
      "acceptanceCriteria": [
        "Repository includes clear instructions to run locally with dfx (frontend + backend).",
        "Docs explain how to enable/disable external places provider keys and how to run demo mode without keys.",
        "Docs explicitly state that Streamlit/Heroku deployment is not applicable for this stack and provide IC deployment steps instead."
      ]
    }
  ],
  "constraints": [
    "Backend must be a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed by the platform.",
    "Do not use Python/Streamlit/Flask/SQLite/Heroku; persistence must use the Internet Computer canister backend state.",
    "No third-party authentication providers; if authentication is needed, use Internet Identity only.",
    "Generated images must be stored as static assets in frontend/public/assets/generated and served directly by the frontend (not via backend)."
  ],
  "nonGoals": [
    "Real-time chat or WebSocket-based live updates.",
    "Exact, guaranteed in-store item availability verification (only category/heuristic matching and provider-supported metadata).",
    "Direct integrations with delivery apps (only generic suggestions/links text).",
    "Payments or checkout flows."
  ],
  "imageRequirements": {
    "required": [
      "App logo mark: simple grocery bag + clock icon, flat style, warm palette (logo-shopping-schedule.dim_512x512.png)",
      "Illustrated hero/banner: busy Indian city grocery run theme, minimal flat illustration, warm palette (hero-grocery-run.dim_1600x600.png)",
      "Map pin icon set: user pin and shop pin, flat style, high contrast (map-pins-set.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Build a full-stack Internet Computer app that creates personalized grocery shopping schedules with nearby store discovery, map view, exports, persistence, and bilingual UI."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for app documentation and default UI, with an in-app Hindi toggle.",
      "Prioritize mobile-friendly UX for users in India focused on affordability and convenience."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}